
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ВсегоПоТоварам = Товары.Итог("Сумма");
	ВсегоПоУслугам = Услуги.Итог("Сумма");
	ИтоговаяСумма = ВсегоПоТоварам+ВсегоПоУслугам;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		// Заполнение шапки
		ВсегоПоТоварам = ДанныеЗаполнения.ВсегоПоТоварам;
		ВсегоПоУслугам = ДанныеЗаполнения.ВсегоПоУслугам;
		Договор = ДанныеЗаполнения.Договор;
		ИтоговаяСумма = ДанныеЗаполнения.ИтоговаяСумма;
		Клиент = ДанныеЗаполнения.Клиент;
		Сотрудник = ДанныеЗаполнения.Сотрудник;
		Основание = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
			НоваяСтрока.Товар = ТекСтрокаТовары.Товар;
			НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
		КонецЦикла;
		Для Каждого ТекСтрокаУслуги Из ДанныеЗаполнения.Услуги Цикл
			НоваяСтрока = Услуги.Добавить();
			НоваяСтрока.Сумма = ТекСтрокаУслуги.Сумма;
			НоваяСтрока.Услуга = ТекСтрокаУслуги.Услуга;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОборотыПродаж 
	Движения.ОборотыПродаж.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОборотыПродаж.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Клиент;
		Движение.Номенклатура = ТекСтрокаТовары.Товар;
		Движение.Сотрудник = Сотрудник;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
	КонецЦикла;

	// регистр ОборотыПродаж 
	Движения.ОборотыПродаж.Записывать = Истина;
	Для Каждого ТекСтрокаУслуги Из Услуги Цикл
		Движение = Движения.ОборотыПродаж.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Клиент;
		Движение.Номенклатура = ТекСтрокаУслуги.Услуга;
		Движение.Сотрудник = Сотрудник;
		Движение.Сумма = ТекСтрокаУслуги.Сумма;
	КонецЦикла;

	// регистр Взаиморасчеты Приход
	Движения.Взаиморасчеты.Записывать = Истина;
	Движение = Движения.Взаиморасчеты.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Контрагент = Клиент;
	Движение.Сумма = ИтоговаяСумма;

	// регистр БонусыСотрудника 
	Движения.БонусыСотрудника.Записывать = Истина;
	Движение = Движения.БонусыСотрудника.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.СуммаБонусов = ИтоговаяСумма*Сотрудник.ПроцентБонусов/100;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
