
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	Сейчас = ТекущаяДата();
	
	СейчасВремя = Формат(  Сейчас,    "ДЛФ=T");   
	
	ПоказатьОповещениеПользователя("Время: "+ СейчасВремя);
КонецПроцедуры
